app/controllers/v1/sessions_controller.rb

	def create
		 user = User.where(email: params[:email]).first
		if user and user.valid_password?(params[:password])
			user.update(:last_sign_in_at => Time.now.strftime("%H:%M:%S"), :last_sign_in_ip => request.ip)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "liliana.cruz@carvajal.com"], ["LIMIT", 1]]
UPDATE "users" SET "last_sign_in_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2018-09-16 19:15:31"], ["updated_at", "2018-09-16 00:15:31.860000"], ["id", 6]]